Revit 2024 API
Concrete Class
 A static class that provides access to the property names that appear in the Concrete visual asset schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static class Concrete
Visual Basic
Public NotInheritable Class Concrete
Visual C++
public ref class Concrete abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.Concrete
See Also
Concrete Members
Autodesk.Revit.DB.Visual Namespace